import React from "react";
import css from "./AboutMe.module.css";

export const AboutMe = () => {
  return (
    <>
      <main className="container">
        <h1 className={css.titleAboutMe}>About me</h1>
        <p>Семенчук Костянтин</p>
        <p>
          <strong>Вік:</strong> 23 роки
        </p>
        <div className={css.containerText}>
        <section>
          <h2>Про мене</h2>
          <p>
            Я — Junior Frontend розробник з навичками роботи з HTML, CSS,
            JavaScript, React, Redux, TypeScript та іншими сучасними
            вебтехнологіями. Маю досвід як індивідуальної розробки, так і роботи
            в команді на проєктах з адаптивною версткою, авторизацією, REST API
            та збереженням стану.
          </p>
        </section>

        <section>
          <h2>Чому я обрав шлях розробника</h2>
          <p>
            Ще під час навчання я зрозумів, що програмування — це не просто
            професія, а можливість щодня вирішувати цікаві завдання. Мене
            мотивує результат, який я можу бачити одразу в браузері. Вважаю, що
            успіх приходить до тих, хто зацікавлений у своїй справі — саме це і
            надихає мене розвиватися.
          </p>
        </section>

        <section>
          <h2>Що мені подобається в розробці</h2>
          <ul>
            <li>Можливість бачити результат своєї роботи в реальному часі</li>
            <li>Робота з сучасними технологіями та бібліотеками</li>
            <li>Безмежні можливості для розвитку</li>
            <li>Командна співпраця та обмін досвідом</li>
          </ul>
        </section>

        <section>
          <h2>Що мені не подобається</h2>
          <p>
            Найменш приємна частина — це пошук складних, «плаваючих» багів, які
            важко відтворити. Але навіть це — частина професійного росту.
          </p>
        </section>
        </div>
      </main>
    </>
  );
};
